app/controllers/sessions_controller.rb

	def create
		# Sincroniza o BD com o WS
		cliente = SoapConnection::Cliente.login(params[:user][:email], params[:user][:password])
		#user = warden.authenticate(auth_options)
		# O objeto existe no WebService - email e senha certos!
		if !cliente.nil?
			user = User.find_by_email_and_senha(params[:user][:email], params[:user][:password])
			#O objeto não existe no Devise
			if user.nil?
				cliente=SoapConnection::Cliente.carregar(cliente.cdg_id)
				p={:first_name=>cliente.first_name, :last_name=>cliente.last_name, :email => cliente.email, :number_phone => cliente.number_phone, :password => cliente.password, :id => cliente.cdg_id }
				u=User.new_without_callback(p)
				u.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'mail@mail.com' LIMIT 1
UPDATE "users" SET "current_sign_in_ip" = '201.83.142.100', "updated_at" = '2012-08-30 14:55:40.434458', "current_sign_in_at" = '2012-08-30 14:55:40.432851', "sign_in_count" = 27, "last_sign_in_at" = '2012-08-29 23:51:17.571470' WHERE "users"."id" = 1